import { questionProps } from "@/@types/type";

export const question: { [key: string]: questionProps} = {
    q1 : {
        question: "멋쟁이사자처럼에 지원을 하고 싶은데 언제 지원을 할 수 있을까요?",
        answer: "멋쟁이사자처럼은 매년 4월 정도에 모집을 시작하고 있어요, 모집 시작 30일 전 SNS를 통해 사전 알림을 드릴 예정이에요.",
    },
    q2 : {
        question: "멋쟁이사자처럼에서는 어떤 포지션의 팀원들을 구하고 있나요?",
        answer: "멋쟁이사자처럼에서는 현재 기준으로 프론트엔드 · 백엔드 · 디자인 트랙에서 열정있고 끊임없이 성장하고자 하는 팀원들을 모집하고 있어요.",
    },
    q3 : {
        question: "코딩에 대한 관련 지식을 가지고 있지 않아도 지원이 가능한가요?",
        answer: "코딩을 마음 먹고 열심히 배울 열정과 자신만 있다면, 언제든 지원해주세요.",
    },
    q4 : {
        question: "정기 세션의 대면 · 비대면 운영 방식이 궁금해요",
        answer: "정기 세션은 모두 대면으로 진행되며, 상황에 따라 유동적으로 비대면 세션 진행 예정이에요.",
    },
    q5 : {
        question: "비전공자도 멋쟁이사자처럼 지원이 가능한가요?",
        answer: `멋쟁이사자처럼에서는 비전공자들을 위해 '테킷'이라는 플랫폼을 통해 온라인 강의 추가적으로 제공을 하고 있어요.`,
    },
    q6 : {
        question: "불합격한 이력이 있어도 재지원이 가능한가요?",
        answer: "불합격한 이력이 있더라도 재지원하는데 있어서 아무 문제가 없어요, 오히려 더욱 반갑게 맞이할 뿐이랍니다.",
    }
}                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               